tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18855_tdd.h
#define C2INTP                        2765
#define CM2NSEL                       2766
#define C2NCH0                        2767
#define CM2NSEL_NCH0                  2768
#define C2NCH                         2769
#define CM2NSEL_NCH                   2770
#define C2NCH1                        2771
#define CM2NSEL_NCH1                  2772
#define C2NCH2                        2773
#define CM2NSEL_NCH2                  2774
#define CM2PSEL                       2775
#define CM2PSEL_PCH                   2776
#define C2PCH                         2777
#define C2PCH0                        2778
#define CM2PSEL_PCH0                  2779
#define C2PCH1                        2780
#define CM2PSEL_PCH1                  2781
#define CM2PSEL_PCH2                  2782
#define C2PCH2                        2783
#define CLCDATA                       2784
#define MLC1OUT                       2785
#define MLC2OUT                       2786
#define MLC3OUT                       2787
#define MLC4OUT                       2788
#define CLC1CON                       2789
#define CLC1CON_MODE                  2790
#define LC1MODE0                      2791
#define LC1MODE                       2792
#define CLC1CON_MODE0                 2793
#define LC1MODE1                      2794
#define CLC1CON_MODE1                 2795
#define LC1MODE2                      2796
#define CLC1CON_MODE2                 2797
#define LC1INTN                       2798
#define CLC1CON_INTN                  2799
#define LC1INTP                       2800
#define CLC1CON_INTP                  2801
#define LC1OUT                        2802
#define CLC1CON_OUT                   2803
#define LC1EN                         2804
#define CLC1CON_EN                    2805
#define CLC1POL                       2806
#define LC1G1POL                      2807
#define CLC1POL_G1POL                 2808
#define CLC1POL_G2POL                 2809
#define LC1G2POL                      2810
#define LC1G3POL                      2811
#define CLC1POL_G3POL                 2812
#define LC1G4POL                      2813
#define CLC1POL_G4POL                 2814
#define CLC1POL_POL                   2815
#define LC1POL                        2816
#define CLC1SEL0                      2817
#define LC1D1S                        2818
#define CLC1SEL0_D1S0                 2819
#define LC1D1S0                       2820
#define CLC1SEL0_D1S                  2821
#define CLC1SEL0_D1S1                 2822
#define LC1D1S1                       2823
#define CLC1SEL0_D1S2                 2824
#define LC1D1S2                       2825
#define CLC1SEL0_D1S3                 2826
#define LC1D1S3                       2827
#define LC1D1S4                       2828
#define CLC1SEL0_D1S4                 2829
#define CLC1SEL0_D1S5                 2830
#define LC1D1S5                       2831
#define LC1D1S6                       2832
#define CLC1SEL0_D1S6                 2833
#define LC1D1S7                       2834
#define CLC1SEL0_D1S7                 2835
#define CLC1SEL1                      2836
#define CLC1SEL1_D2S                  2837
#define CLC1SEL1_D2S0                 2838
#define LC1D2S0                       2839
#define LC1D2S                        2840
#define CLC1SEL1_D2S1                 2841
#define LC1D2S1                       2842
#define CLC1SEL1_D2S2                 2843
#define LC1D2S2                       2844
#define CLC1SEL1_D2S3                 2845
#define LC1D2S3                       2846
#define LC1D2S4                       2847
#define CLC1SEL1_D2S4                 2848
#define D2S5                          2849
#define LC1D2S5                       2850
#define LC1D2S6                       2851
#define CLC1SEL1_D2S6                 2852
#define CLC1SEL1_D2S7                 2853
#define LC1D2S7                       2854
#define CLC1SEL2                      2855
#define CLC1SEL2_D3S                  2856
#define LC1D3S0                       2857
#define LC1D3S                        2858
#define CLC1SEL2_D3S0                 2859
#define LC1D3S1                       2860
#define CLC1SEL2_D3S1                 2861
#define LC1D3S2                       2862
#define CLC1SEL2_D3S2                 2863
#define LC1D3S3                       2864
#define CLC1SEL2_D3S3                 2865
#define LC1D3S4                       2866
#define CLC1SEL2_D3S4                 2867
#define LC1D3S5                       2868
#define CLC1SEL2_D3S5                 2869
#define LC1D3S6                       2870
#define CLC1SEL2_D3S6                 2871
#define LC1D3S7                       2872
#define CLC1SEL2_D3S7                 2873
#define CLC1SEL3                      2874
#define LC1D4S                        2875
#define CLC1SEL3_D4S                  2876
#define LC1D4S0                       2877
#define CLC1SEL3_D4S0                 2878
#define LC1D4S1                       2879
#define CLC1SEL3_D4S1                 2880
#define LC1D4S2                       2881
#define CLC1SEL3_D4S2                 2882
#define LC1D4S3                       2883
#define CLC1SEL3_D4S3                 2884
#define LC1D4S4                       2885
#define CLC1SEL3_D4S4                 2886
#define LC1D4S5                       2887
#define CLC1SEL3_D4S5                 2888
#define LC1D4S6                       2889
#define CLC1SEL3_D4S6                 2890
#define LC1D4S7                       2891
#define CLC1SEL3_D4S7                 2892
#define CLC1GLS0                      2893
#define CLC1GLS0_D1N                  2894
#define LC1G1D1N                      2895
#define CLC1GLS0_D1T                  2896
#define LC1G1D1T                      2897
#define LC1G1D2N                      2898
#define CLC1GLS0_D2N                  2899
#define LC1G1D2T                      2900
#define CLC1GLS0_D2T                  2901
#define CLC1GLS0_D3N                  2902
#define LC1G1D3N                      2903
#define CLC1GLS0_D3T                  2904
#define LC1G1D3T                      2905
#define CLC1GLS0_D4N                  2906
#define LC1G1D4N                      2907
#define CLC1GLS0_D4T                  2908
#define LC1G1D4T                      2909
#define CLC1GLS1                      2910
#define CLC1GLS1_D1N                  2911
#define LC1G2D1N                      2912
#define LC1G2D1T                      2913
#define CLC1GLS1_D1T                  2914
#define CLC1GLS1_D2N                  2915
#define LC1G2D2N                      2916
#define LC1G2D2T                      2917
#define CLC1GLS1_D2T                  2918
#define CLC1GLS1_D3N                  2919
#define LC1G2D3N                      2920
#define LC1G2D3T                      2921
#define CLC1GLS1_D3T                  2922
#define CLC1GLS1_D4N                  2923
#define LC1G2D4N                      2924
#define LC1G2D4T                      2925
#define CLC1GLS1_D4T                  2926
#define CLC1GLS2                      2927
#define CLC1GLS2_D1N                  2928
#define LC1G3D1N                      2929
#define LC1G3D1T                      2930
#define CLC1GLS2_D1T                  2931
#define LC1G3D2N                      2932
#define CLC1GLS2_D2N                  2933
#define LC1G3D2T                      2934
#define CLC1GLS2_D2T                  2935
#define CLC1GLS2_D3N                  2936
#define LC1G3D3N                      2937
#define LC1G3D3T                      2938
#define CLC1GLS2_D3T                  2939
#define LC1G3D4N                      2940
#define CLC1GLS2_D4N                  2941
#define LC1G3D4T                      2942
#define CLC1GLS2_D4T                  2943
#define CLC1GLS3                      2944
#define LC1G4D1N                      2945
#define CLC1GLS3_G4D1N                2946
#define LC1G4D1T                      2947
#define CLC1GLS3_G4D1T                2948
#define CLC1GLS3_G4D2N                2949
#define LC1G4D2N                      2950
#define CLC1GLS3_G4D2T                2951
#define LC1G4D2T                      2952
#define LC1G4D3N                      2953
#define CLC1GLS3_G4D3N                2954
#define LC1G4D3T                      2955
#define CLC1GLS3_G4D3T                2956
#define CLC1GLS3_G4D4N                2957
#define LC1G4D4N                      2958
#define CLC1GLS3_G4D4T                2959
#define LC1G4D4T                      2960
#define CLC2CON                       2961
#define LC2MODE0                      2962
#define CLC2CON_MODE                  2963
#define LC2MODE                       2964
#define CLC2CON_MODE0                 2965
#define LC2MODE1                      2966
#define CLC2CON_MODE1                 2967
#define LC2MODE2                      2968
#define CLC2CON_MODE2                 2969
#define LC2INTN                       2970
#define CLC2CON_INTN                  2971
#define LC2INTP                       2972
#define CLC2CON_INTP                  2973
#define CLC2CON_OUT                   2974
#define LC2OUT                        2975
#define CLC2CON_EN                    2976
#define LC2EN                         2977
#define CLC2POL                       2978
#define LC2G1POL                      2979
#define CLC2POL_G1POL                 2980
#define LC2G2POL                      2981
#define CLC2POL_G2POL                 2982
#define LC2G3POL                      2983
#define CLC2POL_G3POL                 2984
#define LC2G4POL                      2985
#define CLC2POL_G4POL                 2986
#define CLC2POL_POL                   2987
#define LC2POL                        2988
#define CLC2SEL0                      2989
#define CLC2SEL0_D1S                  2990
#define LC2D1S                        2991
#define LC2D1S0                       2992
#define CLC2SEL0_D1S0                 2993
#define LC2D1S1                       2994
#define CLC2SEL0_D1S1                 2995
#define LC2D1S2                       2996
#define CLC2SEL0_D1S2                 2997
#define LC2D1S3                       2998
#define CLC2SEL0_D1S3                 2999
#define LC2D1S4                       3000
#define CLC2SEL0_D1S4                 3001
#define LC2D1S5                       3002
#define CLC2SEL0_D1S5                 3003
#define LC2D1S6                       3004
#define CLC2SEL0_D1S6                 3005
#define LC2D1S7                       3006
#define CLC2SEL0_D1S7                 3007
#define CLC2SEL1                      3008
#define LC2D2S0                       3009
#define LC2D2S                        3010
#define CLC2SEL1_D2S                  3011
#define CLC2SEL1_D2S0                 3012
#define LC2D2S1                       3013
#define CLC2SEL1_D2S1                 3014
#define LC2D2S2                       3015
#define CLC2SEL1_D2S2                 3016
#define LC2D2S3                       3017
#define CLC2SEL1_D2S3                 3018
#define LC2D2S4                       3019
#define CLC2SEL1_D2S4                 3020
#define LC2D2S5                       3021
#define CLC2SEL1_D2S5                 3022
#define LC2D2S6                       3023
#define CLC2SEL1_D2S6                 3024
#define LC2D2S7                       3025
#define CLC2SEL1_D2S7                 3026
#define CLC2SEL2                      3027
#define CLC2SEL2_D3S0                 3028
#define LC2D3S                        3029
#define CLC2SEL2_D3S                  3030
#define LC2D3S0                       3031
#define CLC2SEL2_D3S1                 3032
#define LC2D3S1                       3033
#define CLC2SEL2_D3S2                 3034
#define LC2D3S2                       3035
#define CLC2SEL2_D3S3                 3036
#define LC2D3S3                       3037
#define CLC2SEL2_D3S4                 3038
#define LC2D3S4                       3039
#define CLC2SEL2_D3S5                 3040
#define LC2D3S5                       3041
#define CLC2SEL2_D3S6                 3042
#define LC2D3S6                       3043
#define CLC2SEL2_D3S7                 3044
#define LC2D3S7                       3045
#define CLC2SEL3                      3046
#define LC2D4S                        3047
#define CLC2SEL3_D4S0                 3048
#define LC2D4S0                       3049
#define CLC2SEL3_D4S                  3050
#define CLC2SEL3_D4S1                 3051
#define LC2D4S1                       3052
#define CLC2SEL3_D4S2                 3053
#define LC2D4S2                       3054
#define CLC2SEL3_D4S3                 3055
#define LC2D4S3                       3056
#define CLC2SEL3_D4S4                 3057
#define LC2D4S4                       3058
#define CLC2SEL3_D4S5                 3059
#define LC2D4S5                       3060
#define CLC2SEL3_D4S6                 3061
#define LC2D4S6                       3062
#define CLC2SEL3_D4S7                 3063
#define LC2D4S7                       3064
#define CLC2GLS0                      3065
#define LC2G1D1N                      3066
#define CLC2GLS0_D1N                  3067
#define CLC2GLS0_D1T                  3068
#define LC2G1D1T                      3069
#define LC2G1D2N                      3070
#define CLC2GLS0_D2N                  3071
#define CLC2GLS0_D2T                  3072
#define LC2G1D2T                      3073
#define LC2G1D3N                      3074
#define CLC2GLS0_D3N                  3075
#define CLC2GLS0_D3T                  3076
#define LC2G1D3T                      3077
#define LC2G1D4N                      3078
#define CLC2GLS0_D4N                  3079
#define CLC2GLS0_D4T                  3080
#define LC2G1D4T                      3081
#define CLC2GLS1                      3082
#define CLC2GLS1_D1N                  3083
#define LC2G2D1N                      3084
#define CLC2GLS1_D1T                  3085
#define LC2G2D1T                      3086
#define CLC2GLS1_D2N                  3087
#define LC2G2D2N                      3088
#define CLC2GLS1_D2T                  3089
#define LC2G2D2T                      3090
#define LC2G2D3N                      3091
#define CLC2GLS1_D3N                  3092
#define LC2G2D3T                      3093
#define CLC2GLS1_D3T                  3094
#define LC2G2D4N                      3095
#define CLC2GLS1_D4N                  3096
#define LC2G2D4T                      3097
#define CLC2GLS1_D4T                  3098
#define CLC2GLS2                      3099
#define LC2G3D1N                      3100
#define CLC2GLS2_D1N                  3101
#define CLC2GLS2_D1T                  3102
#define LC2G3D1T                      3103
#define CLC2GLS2_D2N                  3104
#define LC2G3D2N                      3105
#define LC2G3D2T                      3106
#define CLC2GLS2_D2T                  3107
#define CLC2GLS2_D3N                  3108
#define LC2G3D3N                      3109
#define CLC2GLS2_D3T                  3110
#define LC2G3D3T                      3111
#define CLC2GLS2_D4N                  3112
#define LC2G3D4N                      3113
#define LC2G3D4T                      3114
#define CLC2GLS2_D4T                  3115
#define CLC2GLS3                      3116
#define LC2G4D1N                      3117
#define CLC2GLS3_G4D1N                3118
#define CLC2GLS3_G4D1T                3119
#define LC2G4D1T                      3120
#define CLC2GLS3_G4D2N                3121
#define LC2G4D2N                      3122
#define LC2G4D2T                      3123
#define CLC2GLS3_G4D2T                3124
#define CLC2GLS3_G4D3N                3125
#define LC2G4D3N                      3126
#define CLC2GLS3_G4D3T                3127
#define LC2G4D3T                      3128
#define LC2G4D4N                      3129
#define CLC2GLS3_G4D4N                3130
#define CLC2GLS3_G4D4T                3131
#define LC2G4D4T                      3132
#define CLC3CON                       3133
#define LC3MODE                       3134
#define CLC3CON_MODE0                 3135
#define LC3MODE0                      3136
#define CLC3CON_MODE                  3137
#define CLC3CON_MODE1                 3138
#define LC3MODE1                      3139
#define CLC3CON_MODE2                 3140
#define LC3MODE2                      3141
#define LC3INTN                       3142
#define CLC3CON_INTN                  3143
#define LC3INTP                       3144
#define CLC3CON_INTP                  3145
#define LC3OUT                        3146
#define CLC3CON_OUT                   3147
#define LC3EN                         3148
#define CLC3CON_EN                    3149
#define CLC3POL                       3150
#define LC3G1POL                      3151
#define CLC3POL_G1POL                 3152
#define LC3G2POL                      3153
#define CLC3POL_G2POL                 3154
#define CLC3POL_G3POL                 3155
#define LC3G3POL                      3156
#define LC3G4POL                      3157
#define CLC3POL_G4POL                 3158
#define LC3POL                        3159
#define CLC3POL_POL                   3160
#define CLC3SEL0                      3161
#define LC3D1S                        3162
#define CLC3SEL0_D1S                  3163
#define LC3D1S0                       3164
#define CLC3SEL0_D1S0                 3165
#define LC3D1S1                       3166
#define CLC3SEL0_D1S1                 3167
#define LC3D1S2                       3168
#define CLC3SEL0_D1S2                 3169
#define LC3D1S3                       3170
#define CLC3SEL0_D1S3                 3171
#define LC3D1S4                       3172
#define CLC3SEL0_D1S4                 3173
#define LC3D1S5                       3174
#define CLC3SEL0_D1S5                 3175
#define LC3D1S6                       3176
#define CLC3SEL0_D1S6                 3177
#define LC3D1S7                       3178
#define CLC3SEL0_D1S7                 3179
#define CLC3SEL1                      3180
#define LC3D2S0                       3181
#define LC3D2S                        3182
#define CLC3SEL1_D2S0                 3183
#define CLC3SEL1_D2S                  3184
#define LC3D2S1                       3185
#define CLC3SEL1_D2S1                 3186
#define LC3D2S2                       3187
#define CLC3SEL1_D2S2                 3188
#define LC3D2S3                       3189
#define CLC3SEL1_D2S3                 3190
#define LC3D2S4                       3191
#define CLC3SEL1_D2S4                 3192
#define LC3D2S5                       3193
#define CLC3SEL1_D2S5                 3194
#define LC3D2S6                       3195
#define CLC3SEL1_D2S6                 3196
#define LC3D2S7                       3197
#define CLC3SEL1_D2S7                 3198
#define CLC3SEL2                      3199
#define LC3D3S                        3200
#define CLC3SEL2_D3S                  3201
#define LC3D3S0                       3202
#define CLC3SEL2_D3S0                 3203
#define LC3D3S1                       3204
#define CLC3SEL2_D3S1                 3205
#define LC3D3S2                       3206
#define CLC3SEL2_D3S2                 3207
#define LC3D3S3                       3208
#define CLC3SEL2_D3S3                 3209
#define LC3D3S4                       3210
#define CLC3SEL2_D3S4                 3211
#define LC3D3S5                       3212
#define CLC3SEL2_D3S5                 3213
#define LC3D3S6                       3214
#define CLC3SEL2_D3S6                 3215
#define LC3D3S7                       3216
#define CLC3SEL2_D3S7                 3217
#define CLC3SEL3                      3218
#define CLC3SEL3_D4S                  3219
#define LC3D4S0                       3220
#define LC3D4S                        3221
#define CLC3SEL3_D4S0                 3222
#define LC3D4S1                       3223
#define CLC3SEL3_D4S1                 3224
#define LC3D4S2                       3225
#define CLC3SEL3_D4S2                 3226
#define LC3D4S3                       3227
#define CLC3SEL3_D4S3                 3228
#define LC3D4S4                       3229
#define CLC3SEL3_D4S4                 3230
#define LC3D4S5                       3231
#define CLC3SEL3_D4S5                 3232
#define LC3D4S6                       3233
#define CLC3SEL3_D4S6                 3234
#define LC3D4S7                       3235
#define CLC3SEL3_D4S7                 3236
#define CLC3GLS0                      3237
#define CLC3GLS0_D1N                  3238
#define LC3G1D1N                      3239
#define LC3G1D1T                      3240
#define CLC3GLS0_D1T                  3241
#define LC3G1D2N                      3242
#define CLC3GLS0_D2N                  3243
#define CLC3GLS0_D2T                  3244
#define LC3G1D2T                      3245
#define CLC3GLS0_D3N                  3246
#define LC3G1D3N                      3247
#define LC3G1D3T                      3248
#define CLC3GLS0_D3T                  3249
#define CLC3GLS0_D4N                  3250
#define LC3G1D4N                      3251
#define CLC3GLS0_D4T                  3252
#define LC3G1D4T                      3253
#define CLC3GLS1                      3254
#define LC3G2D1N                      3255
#define CLC3GLS1_D1N                  3256
#define CLC3GLS1_D1T                  3257
#define LC3G2D1T                      3258
#define LC3G2D2N                      3259
#define CLC3GLS1_D2N                  3260
#define LC3G2D2T                      3261
#define CLC3GLS1_D2T                  3262
#define LC3G2D3N                      3263
#define CLC3GLS1_D3N                  3264
#define CLC3GLS1_D3T                  3265
#define LC3G2D3T                      3266
#define LC3G2D4N                      3267
#define CLC3GLS1_D4N                  3268
#define LC3G2D4T                      3269
#define CLC3GLS1_D4T                  3270
#define CLC3GLS2                      3271
#define LC3G3D1N                      3272
#define CLC3GLS2_D1N                  3273
#define LC3G3D1T                      3274
#define CLC3GLS2_D1T                  3275
#define CLC3GLS2_D2N                  3276
#define LC3G3D2N                      3277
#define CLC3GLS2_D2T                  3278
#define LC3G3D2T                      3279
#define CLC3GLS2_D3N                  3280
#define LC3G3D3N                      3281
#define LC3G3D3T                      3282
#define CLC3GLS2_D3T                  3283
#define CLC3GLS2_D4N                  3284
#define LC3G3D4N                      3285
#define CLC3GLS2_D4T                  3286
#define LC3G3D4T                      3287
#define CLC3GLS3                      3288
#define LC3G4D1N                      3289
#define CLC3GLS3_G4D1N                3290
#define LC3G4D1T                      3291
#define CLC3GLS3_G4D1T                3292
#define LC3G4D2N                      3293
#define CLC3GLS3_G4D2N                3294
#define CLC3GLS3_G4D2T                3295
#define LC3G4D2T                      3296
#define LC3G4D3N                      3297
#define CLC3GLS3_G4D3N                3298
#define CLC3GLS3_G4D3T                3299
#define LC3G4D3T                      3300
#define LC3G4D4N                      3301
#define CLC3GLS3_G4D4N                3302
#define LC3G4D4T                      3303
#define CLC3GLS3_G4D4T                3304
#define CLC4CON                       3305
#define LC4MODE                       3306
#define CLC4CON_MODE                  3307
#define LC4MODE0                      3308
#define CLC4CON_MODE0                 3309
#define LC4MODE1                      3310
#define CLC4CON_MODE1                 3311
#define LC4MODE2                      3312
#define CLC4CON_MODE2                 3313
#define LC4INTN                       3314
#define CLC4CON_INTN                  3315
#define CLC4CON_INTP                  3316
#define LC4INTP                       3317
#define CLC4CON_OUT                   3318
#define LC4OUT                        3319
#define CLC4CON_EN                    3320
#define LC4EN                         3321
#define CLC4POL                       3322
