tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18855_tdd.h
#define CLC4POL_G1POL                 3323
#define LC4G1POL                      3324
#define CLC4POL_G2POL                 3325
#define LC4G2POL                      3326
#define CLC4POL_G3POL                 3327
#define LC4G3POL                      3328
#define LC4G4POL                      3329
#define CLC4POL_G4POL                 3330
#define LC4POL                        3331
#define CLC4POL_POL                   3332
#define CLC4SEL0                      3333
#define LC4D1S0                       3334
#define CLC4SEL0_D1S                  3335
#define CLC4SEL0_D1S0                 3336
#define LC4D1S                        3337
#define LC4D1S1                       3338
#define CLC4SEL0_D1S1                 3339
#define LC4D1S2                       3340
#define CLC4SEL0_D1S2                 3341
#define LC4D1S3                       3342
#define CLC4SEL0_D1S3                 3343
#define LC4D1S4                       3344
#define CLC4SEL0_D1S4                 3345
#define LC4D1S5                       3346
#define CLC4SEL0_D1S5                 3347
#define LC4D1S6                       3348
#define CLC4SEL0_D1S6                 3349
#define LC4D1S7                       3350
#define CLC4SEL0_D1S7                 3351
#define CLC4SEL1                      3352
#define CLC4SEL1_D2S                  3353
#define CLC4SEL1_D2S0                 3354
#define LC4D2S                        3355
#define LC4D2S0                       3356
#define CLC4SEL1_D2S1                 3357
#define LC4D2S1                       3358
#define CLC4SEL1_D2S2                 3359
#define LC4D2S2                       3360
#define CLC4SEL1_D2S3                 3361
#define LC4D2S3                       3362
#define CLC4SEL1_D2S4                 3363
#define LC4D2S4                       3364
#define CLC4SEL1_D2S5                 3365
#define LC4D2S5                       3366
#define CLC4SEL1_D2S6                 3367
#define LC4D2S6                       3368
#define CLC4SEL1_D2S7                 3369
#define LC4D2S7                       3370
#define CLC4SEL2                      3371
#define CLC4SEL2_D3S                  3372
#define LC4D3S0                       3373
#define LC4D3S                        3374
#define CLC4SEL2_D3S0                 3375
#define LC4D3S1                       3376
#define CLC4SEL2_D3S1                 3377
#define LC4D3S2                       3378
#define CLC4SEL2_D3S2                 3379
#define LC4D3S3                       3380
#define CLC4SEL2_D3S3                 3381
#define LC4D3S4                       3382
#define CLC4SEL2_D3S4                 3383
#define LC4D3S5                       3384
#define CLC4SEL2_D3S5                 3385
#define LC4D3S6                       3386
#define CLC4SEL2_D3S6                 3387
#define LC4D3S7                       3388
#define CLC4SEL2_D3S7                 3389
#define CLC4SEL3                      3390
#define CLC4SEL3_D4S                  3391
#define LC4D4S0                       3392
#define CLC4SEL3_D4S0                 3393
#define LC4D4S                        3394
#define LC4D4S1                       3395
#define CLC4SEL3_D4S1                 3396
#define LC4D4S2                       3397
#define CLC4SEL3_D4S2                 3398
#define LC4D4S3                       3399
#define CLC4SEL3_D4S3                 3400
#define LC4D4S4                       3401
#define CLC4SEL3_D4S4                 3402
#define LC4D4S5                       3403
#define CLC4SEL3_D4S5                 3404
#define LC4D4S6                       3405
#define CLC4SEL3_D4S6                 3406
#define LC4D4S7                       3407
#define CLC4SEL3_D4S7                 3408
#define CLC4GLS0                      3409
#define CLC4GLS0_D1N                  3410
#define LC4G1D1N                      3411
#define CLC4GLS0_D1T                  3412
#define LC4G1D1T                      3413
#define CLC4GLS0_D2N                  3414
#define LC4G1D2N                      3415
#define CLC4GLS0_D2T                  3416
#define LC4G1D2T                      3417
#define CLC4GLS0_D3N                  3418
#define LC4G1D3N                      3419
#define CLC4GLS0_D3T                  3420
#define LC4G1D3T                      3421
#define CLC4GLS0_D4N                  3422
#define LC4G1D4N                      3423
#define CLC4GLS0_D4T                  3424
#define LC4G1D4T                      3425
#define CLC4GLS1                      3426
#define CLC4GLS1_D1N                  3427
#define LC4G2D1N                      3428
#define CLC4GLS1_D1T                  3429
#define LC4G2D1T                      3430
#define LC4G2D2N                      3431
#define CLC4GLS1_D2N                  3432
#define LC4G2D2T                      3433
#define CLC4GLS1_D2T                  3434
#define CLC4GLS1_D3N                  3435
#define LC4G2D3N                      3436
#define LC4G2D3T                      3437
#define CLC4GLS1_D3T                  3438
#define CLC4GLS1_D4N                  3439
#define LC4G2D4N                      3440
#define CLC4GLS1_D4T                  3441
#define LC4G2D4T                      3442
#define CLC4GLS2                      3443
#define CLC4GLS2_D1N                  3444
#define LC4G3D1N                      3445
#define CLC4GLS2_D1T                  3446
#define LC4G3D1T                      3447
#define LC4G3D2N                      3448
#define CLC4GLS2_D2N                  3449
#define LC4G3D2T                      3450
#define CLC4GLS2_D2T                  3451
#define CLC4GLS2_D3N                  3452
#define LC4G3D3N                      3453
#define CLC4GLS2_D3T                  3454
#define LC4G3D3T                      3455
#define LC4G3D4N                      3456
#define CLC4GLS2_D4N                  3457
#define LC4G3D4T                      3458
#define CLC4GLS2_D4T                  3459
#define CLC4GLS3                      3460
#define CLC4GLS3_G4D1N                3461
#define LC4G4D1N                      3462
#define LC4G4D1T                      3463
#define CLC4GLS3_G4D1T                3464
#define LC4G4D2N                      3465
#define CLC4GLS3_G4D2N                3466
#define LC4G4D2T                      3467
#define CLC4GLS3_G4D2T                3468
#define CLC4GLS3_G4D3N                3469
#define LC4G4D3N                      3470
#define CLC4GLS3_G4D3T                3471
#define LC4G4D3T                      3472
#define LC4G4D4N                      3473
#define CLC4GLS3_G4D4N                3474
#define LC4G4D4T                      3475
#define CLC4GLS3_G4D4T                3476
#define PPSLOCK                       3477
#define PPSLOCKED                     3478
#define INTPPS0                       3479
#define INTPPS                        3480
#define INTPPS1                       3481
#define INTPPS2                       3482
#define INTPPS3                       3483
#define T0CKIPPS                      3484
#define T0CKIPPS0                     3485
#define T0CKIPPS1                     3486
#define T0CKIPPS2                     3487
#define T0CKIPPS3                     3488
#define T1CKIPPS0                     3489
#define T1CKIPPS                      3490
#define T1CKIPPS1                     3491
#define T1CKIPPS2                     3492
#define T1CKIPPS3                     3493
#define T1CKIPPS4                     3494
#define T1GPPS0                       3495
#define T1GPPS                        3496
#define T1GPPS1                       3497
#define T1GPPS2                       3498
#define T1GPPS3                       3499
#define T1GPPS4                       3500
#define T3CKIPPS0                     3501
#define T3CKIPPS                      3502
#define T3CKIPPS1                     3503
#define T3CKIPPS2                     3504
#define T3CKIPPS3                     3505
#define T3CKIPPS4                     3506
#define T3GPPS0                       3507
#define T3GPPS                        3508
#define T3GPPS1                       3509
#define T3GPPS2                       3510
#define T3GPPS3                       3511
#define T3GPPS4                       3512
#define T5CKIPPS0                     3513
#define T5CKIPPS                      3514
#define T5CKIPPS1                     3515
#define T5CKIPPS2                     3516
#define T5CKIPPS3                     3517
#define T5CKIPPS4                     3518
#define T5GPPS                        3519
#define T5GPPS0                       3520
#define T5GPPS1                       3521
#define T5GPPS2                       3522
#define T5GPPS3                       3523
#define T5GPPS4                       3524
#define T2AINPPS                      3525
#define T2AINPPS0                     3526
#define T2AINPPS1                     3527
#define T2AINPPS2                     3528
#define T2AINPPS3                     3529
#define T2AINPPS4                     3530
#define T4AINPPS                      3531
#define T4AINPPS0                     3532
#define T4AINPPS1                     3533
#define T4AINPPS2                     3534
#define T4AINPPS3                     3535
#define T4AINPPS4                     3536
#define T6AINPPS0                     3537
#define T6AINPPS                      3538
#define T6AINPPS1                     3539
#define T6AINPPS2                     3540
#define T6AINPPS3                     3541
#define T6AINPPS4                     3542
#define CCP1PPS0                      3543
#define CCP1PPS                       3544
#define CCP1PPS1                      3545
#define CCP1PPS2                      3546
#define CCP1PPS3                      3547
#define CCP1PPS4                      3548
#define CCP2PPS0                      3549
#define CCP2PPS                       3550
#define CCP2PPS1                      3551
#define CCP2PPS2                      3552
#define CCP2PPS3                      3553
#define CCP2PPS4                      3554
#define CCP3PPS0                      3555
#define CCP3PPS                       3556
#define CCP3PPS1                      3557
#define CCP3PPS2                      3558
#define CCP3PPS3                      3559
#define CCP3PPS4                      3560
#define CCP4PPS0                      3561
#define CCP4PPS                       3562
#define CCP4PPS1                      3563
#define CCP4PPS2                      3564
#define CCP4PPS3                      3565
#define CCP4PPS4                      3566
#define CCP5PPS                       3567
#define CCP5PPS0                      3568
#define CCP5PPS1                      3569
#define CCP5PPS2                      3570
#define CCP5PPS3                      3571
#define CCP5PPS4                      3572
#define CCP6PPS                       3573
#define SMT1WINPPS                    3574
#define SMU1WINPPS0                   3575
#define SMU1WINPPS1                   3576
#define SMU1WINPPS2                   3577
#define SMU1WINPPS3                   3578
#define SMU1WINPPS4                   3579
#define SMT1SIGPPS                    3580
#define SMU1SIGPPS0                   3581
#define SMU1SIGPPS1                   3582
#define SMU1SIGPPS2                   3583
#define SMU1SIGPPS3                   3584
#define SMU1SIGPPS4                   3585
#define SMT2WINPPS                    3586
#define SMU2WINPPS0                   3587
#define SMU2WINPPS1                   3588
#define SMU2WINPPS2                   3589
#define SMU2WINPPS3                   3590
#define SMU2WINPPS4                   3591
#define SMT2SIGPPS                    3592
#define SMU2SIGPPS0                   3593
#define SMU2SIGPPS1                   3594
#define SMU2SIGPPS2                   3595
#define SMU2SIGPPS3                   3596
#define SMU2SIGPPS4                   3597
#define CWG1PPS0                      3598
#define CWG1PPS                       3599
#define CWG1PPS1                      3600
#define CWG1PPS2                      3601
#define CWG1PPS3                      3602
#define CWG1PPS4                      3603
#define CWG2PPS0                      3604
#define CWG2PPS                       3605
#define CWG2PPS1                      3606
#define CWG2PPS2                      3607
#define CWG2PPS3                      3608
#define CWG2PPS4                      3609
#define CWG3PPS0                      3610
#define CWG3PPS                       3611
#define CWG3PPS1                      3612
#define CWG3PPS2                      3613
#define CWG3PPS3                      3614
#define CWG3PPS4                      3615
#define MDCARLPPS                     3616
#define MDCARLPPS0                    3617
#define MDCARLPPS1                    3618
#define MDCARLPPS2                    3619
#define MDCARLPPS3                    3620
#define MDCARLPPS4                    3621
#define MDCARHPPS0                    3622
#define MDCARHPPS                     3623
#define MDCARHPPS1                    3624
#define MDCARHPPS2                    3625
#define MDCARHPPS3                    3626
#define MDCARHPPS4                    3627
#define MDSRCPPS0                     3628
#define MDSRCPPS                      3629
#define MDSRCPPS1                     3630
#define MDSRCPPS2                     3631
#define MDSRCPPS3                     3632
#define MDSRCPPS4                     3633
#define CLCIN0PPS                     3634
#define CLCIN0PPS0                    3635
#define CLCIN0PPS1                    3636
#define CLCIN0PPS2                    3637
#define CLCIN0PPS3                    3638
#define CLCIN0PPS4                    3639
#define CLCIN1PPS0                    3640
#define CLCIN1PPS                     3641
#define CLCIN1PPS1                    3642
#define CLCIN1PPS2                    3643
#define CLCIN1PPS3                    3644
#define CLCIN1PPS4                    3645
#define CLCIN2PPS                     3646
#define CLCIN2PPS0                    3647
#define CLCIN2PPS1                    3648
#define CLCIN2PPS2                    3649
#define CLCIN2PPS3                    3650
#define CLCIN2PPS4                    3651
#define CLCIN3PPS                     3652
#define CLCIN3PPS0                    3653
#define CLCIN3PPS1                    3654
#define CLCIN3PPS2                    3655
#define CLCIN3PPS3                    3656
#define CLCIN3PPS4                    3657
#define ADCACTPPS                     3658
#define ADCACTPPS0                    3659
#define ADCACTPPS1                    3660
#define ADCACTPPS2                    3661
#define ADCACTPPS3                    3662
#define ADCACTPPS4                    3663
#define SSP1CLKPPS0                   3664
#define SSP1CLKPPS                    3665
#define SSP1CLKPPS1                   3666
#define SSP1CLKPPS2                   3667
#define SSP1CLKPPS3                   3668
#define SSP1CLKPPS4                   3669
#define SSP1DATPPS0                   3670
#define SSP1DATPPS                    3671
#define SSP1DATPPS1                   3672
#define SSP1DATPPS2                   3673
#define SSP1DATPPS3                   3674
#define SSP1DATPPS4                   3675
#define SSP1SSPPS                     3676
#define SSP1SSPPS0                    3677
#define SSP1SSPPS1                    3678
#define SSP1SSPPS2                    3679
#define SSP1SSPPS3                    3680
#define SSP1SSPPS4                    3681
#define SSP2CLKPPS                    3682
#define SSP2CLKPPS0                   3683
#define SSP2CLKPPS1                   3684
#define SSP2CLKPPS2                   3685
#define SSP2CLKPPS3                   3686
#define SSP2CLKPPS4                   3687
#define SSP2DATPPS                    3688
#define SSP2DATPPS0                   3689
#define SSP2DATPPS1                   3690
#define SSP2DATPPS2                   3691
#define SSP2DATPPS3                   3692
#define SSP2DATPPS4                   3693
#define SSP2SSPPS                     3694
#define SSP2SSPPS0                    3695
#define SSP2SSPPS1                    3696
#define SSP2SSPPS2                    3697
#define SSP2SSPPS3                    3698
#define SSP2SSPPS4                    3699
#define RXPPS                         3700
#define RXPPS0                        3701
#define RXPPS1                        3702
#define RXPPS2                        3703
#define RXPPS3                        3704
#define RXPPS4                        3705
#define TXPPS0                        3706
#define TXPPS                         3707
#define TXPPS1                        3708
#define TXPPS2                        3709
#define TXPPS3                        3710
#define TXPPS4                        3711
#define RA0PPS                        3712
#define RA0PPS0                       3713
#define RA0PPS1                       3714
#define RA0PPS2                       3715
#define RA0PPS3                       3716
#define RA0PPS4                       3717
#define RA0PPS5                       3718
#define RA1PPS                        3719
#define RA1PPS0                       3720
#define RA1PPS1                       3721
#define RA1PPS2                       3722
#define RA1PPS3                       3723
#define RA1PPS4                       3724
#define RA1PPS5                       3725
#define RA2PPS                        3726
#define RA2PPS0                       3727
#define RA2PPS1                       3728
#define RA2PPS2                       3729
#define RA2PPS3                       3730
#define RA2PPS4                       3731
#define RA2PPS5                       3732
#define RA3PPS                        3733
#define RA3PPS0                       3734
#define RA3PPS1                       3735
#define RA3PPS2                       3736
#define RA3PPS3                       3737
#define RA3PPS4                       3738
#define RA3PPS5                       3739
#define RA4PPS                        3740
#define RA4PPS0                       3741
#define RA4PPS1                       3742
#define RA4PPS2                       3743
#define RA4PPS3                       3744
#define RA4PPS4                       3745
#define RA4PPS5                       3746
#define RA5PPS                        3747
#define RA5PPS0                       3748
#define RA5PPS1                       3749
#define RA5PPS2                       3750
#define RA5PPS3                       3751
#define RA5PPS4                       3752
#define RA5PPS5                       3753
#define RA6PPS                        3754
#define RA6PPS0                       3755
#define RA6PPS1                       3756
#define RA6PPS2                       3757
#define RA6PPS3                       3758
#define RA6PPS4                       3759
#define RA6PPS5                       3760
#define RA7PPS                        3761
#define RA7PPS0                       3762
#define RA7PPS1                       3763
#define RA7PPS2                       3764
#define RA7PPS3                       3765
#define RA7PPS4                       3766
#define RA7PPS5                       3767
#define RB0PPS                        3768
#define RB0PPS0                       3769
#define RB0PPS1                       3770
#define RB0PPS2                       3771
#define RB0PPS3                       3772
#define RB0PPS4                       3773
#define RB0PPS5                       3774
#define RB1PPS                        3775
#define RB1PPS0                       3776
#define RB1PPS1                       3777
#define RB1PPS2                       3778
#define RB1PPS3                       3779
#define RB1PPS4                       3780
#define RB1PPS5                       3781
#define RB2PPS                        3782
#define RB2PPS0                       3783
#define RB2PPS1                       3784
#define RB2PPS2                       3785
#define RB2PPS3                       3786
#define RB2PPS4                       3787
#define RB2PPS5                       3788
#define RB3PPS                        3789
#define RB3PPS0                       3790
#define RB3PPS1                       3791
#define RB3PPS2                       3792
#define RB3PPS3                       3793
#define RB3PPS4                       3794
#define RB3PPS5                       3795
#define RB4PPS                        3796
#define RB4PPS0                       3797
#define RB4PPS1                       3798
#define RB4PPS2                       3799
#define RB4PPS3                       3800
#define RB4PPS4                       3801
#define RB4PPS5                       3802
#define RB5PPS                        3803
#define RB5PPS0                       3804
#define RB5PPS1                       3805
#define RB5PPS2                       3806
#define RB5PPS3                       3807
#define RB5PPS4                       3808
#define RB5PPS5                       3809
#define RB6PPS                        3810
#define RB6PPS0                       3811
#define RB6PPS1                       3812
#define RB6PPS2                       3813
#define RB6PPS3                       3814
#define RB6PPS4                       3815
#define RB6PPS5                       3816
#define RB7PPS                        3817
#define RB7PPS0                       3818
#define RB7PPS1                       3819
#define RB7PPS2                       3820
#define RB7PPS3                       3821
#define RB7PPS4                       3822
#define RB7PPS5                       3823
#define RC0PPS                        3824
#define RC0PPS0                       3825
#define RC0PPS1                       3826
#define RC0PPS2                       3827
#define RC0PPS3                       3828
#define RC0PPS4                       3829
#define RC0PPS5                       3830
#define RC1PPS                        3831
#define RC1PPS0                       3832
#define RC1PPS1                       3833
#define RC1PPS2                       3834
#define RC1PPS3                       3835
#define RC1PPS4                       3836
#define RC1PPS5                       3837
#define RC2PPS                        3838
#define RC2PPS0                       3839
#define RC2PPS1                       3840
#define RC2PPS2                       3841
#define RC2PPS3                       3842
#define RC2PPS4                       3843
#define RC2PPS5                       3844
#define RC3PPS                        3845
#define RC3PPS0                       3846
#define RC3PPS1                       3847
#define RC3PPS2                       3848
#define RC3PPS3                       3849
#define RC3PPS4                       3850
#define RC3PPS5                       3851
#define RC4PPS                        3852
#define RC4PPS0                       3853
#define RC4PPS1                       3854
#define RC4PPS2                       3855
#define RC4PPS3                       3856
#define RC4PPS4                       3857
#define RC4PPS5                       3858
#define RC5PPS                        3859
#define RC5PPS0                       3860
#define RC5PPS1                       3861
#define RC5PPS2                       3862
#define RC5PPS3                       3863
#define RC5PPS4                       3864
#define RC5PPS5                       3865
#define RC6PPS                        3866
#define RC6PPS0                       3867
#define RC6PPS1                       3868
#define RC6PPS2                       3869
#define RC6PPS3                       3870
#define RC6PPS4                       3871
#define RC6PPS5                       3872
#define RC7PPS                        3873
#define RC7PPS0                       3874
#define RC7PPS1                       3875
#define RC7PPS2                       3876
#define RC7PPS3                       3877
#define RC7PPS4                       3878
#define RC7PPS5                       3879
#define ANSELA                        3880
