tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18855_tdd.h
#define ANSA0                         3881
#define ANSA1                         3882
#define ANSA2                         3883
#define ANSA3                         3884
#define ANSA4                         3885
#define ANSA5                         3886
#define ANSA6                         3887
#define ANSA7                         3888
#define WPUA                          3889
#define WPUA0                         3890
#define WPUA1                         3891
#define WPUA2                         3892
#define WPUA3                         3893
#define WPUA4                         3894
#define WPUA5                         3895
#define WPUA6                         3896
#define WPUA7                         3897
#define ODCONA                        3898
#define ODCA0                         3899
#define ODCA1                         3900
#define ODCA2                         3901
#define ODCA3                         3902
#define ODCA4                         3903
#define ODCA5                         3904
#define ODCA6                         3905
#define ODCA7                         3906
#define SLRCONA                       3907
#define SLRA0                         3908
#define SLRA1                         3909
#define SLRA2                         3910
#define SLRA3                         3911
#define SLRA4                         3912
#define SLRA5                         3913
#define SLRA6                         3914
#define SLRA7                         3915
#define INLVLA                        3916
#define INLVLA0                       3917
#define INLVLA1                       3918
#define INLVLA2                       3919
#define INLVLA3                       3920
#define INLVLA4                       3921
#define INLVLA5                       3922
#define INLVLA6                       3923
#define INLVLA7                       3924
#define IOCAP                         3925
#define IOCAP0                        3926
#define IOCAP1                        3927
#define IOCAP2                        3928
#define IOCAP3                        3929
#define IOCAP4                        3930
#define IOCAP5                        3931
#define IOCAP6                        3932
#define IOCAP7                        3933
#define IOCAN                         3934
#define IOCAN0                        3935
#define IOCAN1                        3936
#define IOCAN2                        3937
#define IOCAN3                        3938
#define IOCAN4                        3939
#define IOCAN5                        3940
#define IOCAN6                        3941
#define IOCAN7                        3942
#define IOCAF                         3943
#define IOCAF0                        3944
#define IOCAF1                        3945
#define IOCAF2                        3946
#define IOCAF3                        3947
#define IOCAF4                        3948
#define IOCAF5                        3949
#define IOCAF6                        3950
#define IOCAF7                        3951
#define CCDNA                         3952
#define CCDNA0                        3953
#define CCDNA1                        3954
#define CCDNA2                        3955
#define CCDNA3                        3956
#define CCDNA4                        3957
#define CCDNA5                        3958
#define CCDNA6                        3959
#define CCDNA7                        3960
#define CCDPA                         3961
#define CCDPA0                        3962
#define CCDPA1                        3963
#define CCDPA2                        3964
#define CCDPA3                        3965
#define CCDPA4                        3966
#define CCDPA5                        3967
#define CCDPA6                        3968
#define CCDPA7                        3969
#define ANSELB                        3970
#define ANSB0                         3971
#define ANSB1                         3972
#define ANSB2                         3973
#define ANSB3                         3974
#define ANSB4                         3975
#define ANSB5                         3976
#define ANSB6                         3977
#define ANSB7                         3978
#define WPUB                          3979
#define WPUB0                         3980
#define WPUB1                         3981
#define WPUB2                         3982
#define WPUB3                         3983
#define WPUB4                         3984
#define WPUB5                         3985
#define WPUB6                         3986
#define WPUB7                         3987
#define ODCONB                        3988
#define ODCB0                         3989
#define ODCB1                         3990
#define ODCB2                         3991
#define ODCB3                         3992
#define ODCB4                         3993
#define ODCB5                         3994
#define ODCB6                         3995
#define ODCB7                         3996
#define SLRCONB                       3997
#define SLRB0                         3998
#define SLRB1                         3999
#define SLRB2                         4000
#define SLRB3                         4001
#define SLRB4                         4002
#define SLRB5                         4003
#define SLRB6                         4004
#define SLRB7                         4005
#define INLVLB                        4006
#define INLVLB0                       4007
#define INLVLB1                       4008
#define INLVLB2                       4009
#define INLVLB3                       4010
#define INLVLB4                       4011
#define INLVLB5                       4012
#define INLVLB6                       4013
#define INLVLB7                       4014
#define IOCBP                         4015
#define IOCBP0                        4016
#define IOCBP1                        4017
#define IOCBP2                        4018
#define IOCBP3                        4019
#define IOCBP4                        4020
#define IOCBP5                        4021
#define IOCBP6                        4022
#define IOCBP7                        4023
#define IOCBN                         4024
#define IOCBN0                        4025
#define IOCBN1                        4026
#define IOCBN2                        4027
#define IOCBN3                        4028
#define IOCBN4                        4029
#define IOCBN5                        4030
#define IOCBN6                        4031
#define IOCBN7                        4032
#define IOCBF                         4033
#define IOCBF0                        4034
#define IOCBF1                        4035
#define IOCBF2                        4036
#define IOCBF3                        4037
#define IOCBF4                        4038
#define IOCBF5                        4039
#define IOCBF6                        4040
#define IOCBF7                        4041
#define CCDNB                         4042
#define CCDNB0                        4043
#define CCDNB1                        4044
#define CCDNB2                        4045
#define CCDNB3                        4046
#define CCDNB4                        4047
#define CCDNB5                        4048
#define CCDNB6                        4049
#define CCDNB7                        4050
#define CCDPB                         4051
#define CCDPB0                        4052
#define CCDPB1                        4053
#define CCDPB2                        4054
#define CCDPB3                        4055
#define CCDPB4                        4056
#define CCDPB5                        4057
#define CCDPB6                        4058
#define CCDPB7                        4059
#define ANSELC                        4060
#define ANSC0                         4061
#define ANSC1                         4062
#define ANSC2                         4063
#define ANSC3                         4064
#define ANSC4                         4065
#define ANSC5                         4066
#define ANSC6                         4067
#define ANSC7                         4068
#define WPUC                          4069
#define WPUC0                         4070
#define WPUC1                         4071
#define WPUC2                         4072
#define WPUC3                         4073
#define WPUC4                         4074
#define WPUC5                         4075
#define WPUC6                         4076
#define WPUC7                         4077
#define ODCONC                        4078
#define ODCC0                         4079
#define ODCC1                         4080
#define ODCC2                         4081
#define ODCC3                         4082
#define ODCC4                         4083
#define ODCC5                         4084
#define ODCC6                         4085
#define ODCC7                         4086
#define SLRCONC                       4087
#define SLRC0                         4088
#define SLRC1                         4089
#define SLRC2                         4090
#define SLRC3                         4091
#define SLRC4                         4092
#define SLRC5                         4093
#define SLRC6                         4094
#define SLRC7                         4095
#define INLVLC                        4096
#define INLVLC0                       4097
#define INLVLC1                       4098
#define INLVLC2                       4099
#define INLVLC3                       4100
#define INLVLC4                       4101
#define INLVLC5                       4102
#define INLVLC6                       4103
#define INLVLC7                       4104
#define IOCCP                         4105
#define IOCCP0                        4106
#define IOCCP1                        4107
#define IOCCP2                        4108
#define IOCCP3                        4109
#define IOCCP4                        4110
#define IOCCP5                        4111
#define IOCCP6                        4112
#define IOCCP7                        4113
#define IOCCN                         4114
#define IOCCN0                        4115
#define IOCCN1                        4116
#define IOCCN2                        4117
#define IOCCN3                        4118
#define IOCCN4                        4119
#define IOCCN5                        4120
#define IOCCN6                        4121
#define IOCCN7                        4122
#define IOCCF                         4123
#define IOCCF0                        4124
#define IOCCF1                        4125
#define IOCCF2                        4126
#define IOCCF3                        4127
#define IOCCF4                        4128
#define IOCCF5                        4129
#define IOCCF6                        4130
#define IOCCF7                        4131
#define CCDNC                         4132
#define CCDNC0                        4133
#define CCDNC1                        4134
#define CCDNC2                        4135
#define CCDNC3                        4136
#define CCDNC4                        4137
#define CCDNC5                        4138
#define CCDNC6                        4139
#define CCDNC7                        4140
#define CCDPC                         4141
#define CCDPC0                        4142
#define CCDPC1                        4143
#define CCDPC2                        4144
#define CCDPC3                        4145
#define CCDPC4                        4146
#define CCDPC5                        4147
#define CCDPC6                        4148
#define CCDPC7                        4149
#define WPUE                          4150
#define WPUE3                         4151
#define INLVLE                        4152
#define INLVLE3                       4153
#define IOCEP                         4154
#define IOCEP3                        4155
#define IOCEN                         4156
#define IOCEN3                        4157
#define IOCEF                         4158
#define IOCEF3                        4159
#define STATUS_SHAD                   4160
#define C_SHAD                        4161
#define DC_SHAD                       4162
#define Z_SHAD                        4163
#define WREG_SHAD                     4164
#define BSR_SHAD                      4165
#define PCLATH_SHAD                   4166
#define FSR0L_SHAD                    4167
#define FSR0H_SHAD                    4168
#define FSR1L_SHAD                    4169
#define FSR1H_SHAD                    4170
#define STKPTR                        4171
#define TOSL                          4172
#define TOSH                          4173

#endif // _PIC16F18855_H_
